orgs/2015-1-7-Install-Emmet-in-SublimeText3.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS: toc:nil
#+BEGIN_HTML
---
excerpt: Emmet is also known as zen code
layout: post
category : HTML5
tags : [tools, sublimetext]
---
#+END_HTML

* Install the Package Manager in SublimeText3
  [[https://packagecontrol.io/installation][or follow this link]]
** Click the Preferences > Browse Packages… menu
** Browse up a folder and then into the Installed Packages/ folder
** Download Package [[https://packagecontrol.io/Package%20Control.sublime-package][Control.sublime-package]] and copy it into the Installed Packages/ directory
** Restart Sublime Text

* Install Emmet using the Package Manager
** type Command + Shift + P and type "Install", press Enter, type "Emmet" and press Enter again.

* Install the Python package (if needed)
** [[https://github.com/emmetio/pyv8-binaries][Download PyV8]]
** Unpack contents of downloaded archive into PyV8/%filename% folder inside Sublime Text Packages (find Browse Packages... menu item in ST2 editor to get into Packages folder), where %filename% is the name of downloaded file (e.g. it will be pyv8-win64-p3 if you download pyv8-win64-p3.zip file).
** Restart ST editor.