_posts/2015-1-7-Install-Emmet-in-SublimeText3.html
---
excerpt: Emmet is also known as zen code
layout: post
category : HTML5
tags : [tools, sublimetext]
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Install the Package Manager in SublimeText3</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://packagecontrol.io/installation">or follow this link</a>
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Click the Preferences &gt; Browse Packages… menu</h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Browse up a folder and then into the Installed Packages/ folder</h3>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Download Package <a href="https://packagecontrol.io/Package%20Control.sublime-package">Control.sublime-package</a> and copy it into the Installed Packages/ directory</h3>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Restart Sublime Text</h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Install Emmet using the Package Manager</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> type Command + Shift + P and type "Install", press Enter, type "Emmet" and press Enter again.</h3>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Install the Python package (if needed)</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> <a href="https://github.com/emmetio/pyv8-binaries">Download PyV8</a></h3>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Unpack contents of downloaded archive into PyV8/%filename% folder inside Sublime Text Packages (find Browse Packages&#x2026; menu item in ST editor to get into 'Installed Packages' folder), where %filename% is the name of downloaded file (e.g. it will be pyv8-win64-p3 if you download pyv8-win64-p3.zip file).</h3>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Restart ST editor.</h3>
</div>
</div>
